Repository: QwIT-Development/firka-localization
Catalog: app_*.arb
Languages: hu, zu

# restart_title
source: Restart application
hu: Alkalmazás újraindítása

# restart_body
source: Click here to open the app again.
hu: Kattints ide az alkalmazás megnyitásához.

# loginBtn
source: Login with E-Kréta
hu: Bejelentkezés E-Kréta fiókkal
zu: Log in wif E-Kréta akkownt

# privacyLabel
source: Privacy policy
hu: Adatvédelmi tájékoztató
zu: Privacee infurrmashun

# title1
source: Know everything at a glance
hu: Egy pillantásra tudhatsz mindent
zu: Ur gettin worse? U can see dat liek, ten wayz

# subtitle1
source: On the top of the home screen you can see useful info about your day.
hu: A főoldal tetején hasznos információkat láthatsz a napodról.
zu: So many statz u can seez! Teh 8-grade maff in ur head? Iz not gonna be enuf to make sens of it!

# title2
source: Your classes fit here
hu: A tantárgyaid kényelmesen elférnek itt
zu: Ur oopsies? Dey on a graf nao so u can watch dem

# subtitle2
source: See statistics, upcoming tests, and even your grades from previous school years.
hu: Láss statisztikákat, közelgő számonkéréseket, és akár a régebbi tanéves jegyeidet is.
zu: Lookit teh curvz pointin down! Iz jus liek ur life...

# title3
source: Customizable timetable
hu: Személyre szabható órarend
zu: We uze numbrz to show u how bad u r doin

# subtitle3
source: Select what you want to see on the timetable page, turn on or off test, assignments, breaks, and free periods.
hu: Válaszd ki, mit szeretnél látni az órarend oldalon, kapcsold ki vagy be a számonkéréseket, házi feladatokat, szüneteket és lyukas órákat is.
zu: Liek, we try shine up teh statz, but dey still paint u as big fail.

# title4
source: Many extras you will never find in Kréta
hu: Sok extra dolog, amit a Krétában sosem fogsz megtalálni
zu: Statz dat proov wut evrybuddy suspected

source: Yesterday
hu: Tegnap
zu: Yesturdey

source: Today
hu: Ma
zu: Tuday

source: Tomorrow
hu: Holnap
zu: Tomoro

# debug_screen
source: Developer options
hu: Fejlesztői menü

# settings_screen
source: Settings
hu: Beállítások

source: Home
hu: Kezdőlap
zu: Home Payj

source: Grades
hu: Jegyek
zu: Graydz

source: Timetable
hu: Órarend
zu: Tiemtaybl

source: Other
hu: Több
zu: Moar

source: Refreshing...
hu: Adatok frissítése...
zu: Updaytin dataz...

# reauth
source: Reauthentication required
hu: Bejelentkezés szükséges

# api_error
source: Kréta API error
hu: Kréta API hiba
zu: Kréta API hiba

# pairing
source: Pair your watch
hu: Óra párosítása

# pairing_description
source: Would you like to pair this watch with the Firka app? After pairing, you will be able to see your timetable, new grades, tests and tasks.
hu: Szeretnéd ezt az órát párosítani a Firka appal? Párosítás láthatod az órarendet, és a legújabb jegyeidet, számonkéréseidet, és a feladataidat.

source: Cancel
hu: Mégse

source: Save
hu: Mentés

source: Okay
hu: Rendben

source: Pair
hu: Párosítás

# beta_title
source: Firka - Public Beta
hu: Firka - Publikus béta

# beta_body
source: The application is still in development; some features may be unfinished, not work correctly, or be buggy.
hu: Az alkalmazás fejlesztés alatt áll; egyes funkciók hibásan működhetnek, nem működnek, vagy még nem készültek el.

# good_morning
source: Good morning, {p}!
hu: Jó reggelt, {p}!
zu: Jó reggelt, {p}!

# happy_birthday
source: Happy birthday, {p}!
hu: Boldog születésnapot, {p}!

# good_day
source: Good day, {p}!
hu: Szép napot, {p}!
zu: Szép napot, {p}!

# n_left_subtitle
source: Hang in there, there's only {n} lessons left!
hu: Tarts ki, már csak {n} óra!
zu: Tarts ki, már csak {n} óra!

# suffering_almost_over_subtitle
source: You're almost free. Keep pay attention to your teacher.
hu: Mindjárt szabad vagy. Figyelj oda a tanárra.
zu: Mindjárt szabad vagy. Figyelj oda a tanárra.

# school_ending
source: Are you anxious, {p}?
hu: Izgulsz, {p}?
zu: Izgulsz, {p}?

# tomorrow_subtitle
source: Your next day
hu: Itt a holnapi napod.
zu: Itt a holnapi napod.

# good_afternoon
source: Good afternoon, {p}!
hu: Szép délutánt, {p}!
zu: Szép délutánt, {p}!

# good_night
source: Good evening, {p}!
hu: Szép estét, {p}!
zu: Szép estét, {p}!

# tests_tomorrow
source: You have {tests} test(s) tomorrow
hu: {tests} dolgozatod lesz

# lessons_tomorrow
source: You have {lessons} lesson(s) tomorrow
hu: {lessons} órád lesz

source: No tests tomorrow
hu: Holnap nincs dolgozatod

# get_ready
source: Rest up and get ready
hu: Pihend ki magad, és készülj fel

source: Homework
hu: Házi feladat

source: Mark as done
hu: Megjelölés befejezettként

source: Mark as not done
hu: Megjelölés befejezetlenként

# starting_soon
source: Your first lesson will start soon!
hu: Hamarosan kezdődik az első órád!
zu: Hamarosan kezdődik az első órád!

# starting_hour
source: hour
hu: óra
zu: óra

# starting_hour_plural
source: hours
hu: óra
zu: óra

# starting_min
source: min
hu: perc
zu: perc

# starting_min_plural
source: mins
hu: perc
zu: perc

# starting_sec
source: sec
hu: másodperc
zu: másodperc

# starting_sec_plural
source: secs
hu: másodperc
zu: másodperc

source: Subjects
hu: Tantárgyak
zu: Subjekts

# your_subjects
source: Subjects
hu: Tantárgyaid
zu: Ur Subjekts

# data
source: Info
hu: Adatok
zu: Stuffz

# gradesCount
source: {count} grades
hu: {count} jegy

# subject_avg
source: Subject average
hu: Tantárgyi átlag
zu: Subjekt avuraj

# subject_avg_rounded
source: Subject average after rounding
hu: Tantárgyi átlag kerekítés után

# class_avg
source: Class average
hu: Osztályátlag
zu: Klass avuraj

# class_n
source: Weekly lesson number
hu: Heti óraszám
zu: Weeklee howrz

# grade_teacherName
source: Teacher:
hu: Tanár neve:

# grade_strValue
source: Text grade:
hu: Szöveges értékelés:

# no_grades
source: No grades in this subject yet.
hu: Ebből a tantárgyból még nincsen jegyed.

source: Unknown teacher
hu: Ismeretlen tanár

# tt_no_classes_l1
source: You don't have any lessons this week!
hu: Ezen a napon nincsenek óráid!
zu: Ezen a napon nincsenek óráid!

# tt_added
source: Added:
hu: Beírva:

# class_dismissed
source: Dismissed lesson
hu: Elmaradt óra
zu: Elmaradt óra

# class_substitution
source: Substitution
hu: Helyettesítés
zu: Helyettesítés

source: Lesson subject
hu: Az óra tárgya
zu: Az óra tárgya

# view_subject_btn
source: View subject
hu: Tantárgy megtekintése

# view_lesson_btn
source: View lesson
hu: Óra megtekintése

# tt_settings_toast
source: Timetable settings
hu: Órarend beállításai

# tt_settings_toast_lesson_nos
source: Number of lessons
hu: Óraszámok

# tt_settings_toast_lesson_tests
source: Tests & others
hu: Számonkérések & egyéb

# tt_settings_toast_lesson_breaks
source: Breaks
hu: Szünetek

# tt_settings_toast_lesson_substitution
source: Substitutions
hu: Helyettesítések

# tt_settings_toast_lesson_ab_timetable
source: Two-week timetable
hu: Kéthetes órarend

source: A week
hu: A hét

source: B week
hu: B hét

# stats_date
source: Date
hu: Dátum

# stats_created_at
source: Created at
hu: Létrehozva

# stats_last_mod
source: Last modified
hu: Utoljára módosítva

# s_developer
source: Developer settings
hu: Fejlesztői beállítások

# s_stats_for_nerds
source: Stats for nerds
hu: Extra információ mutatása

# s_settings
source: Settings
hu: Beállítások

# s_a
source: Application
hu: Alkalmazás

# s_ag
source: General
hu: Általános

# s_ag_bell_delay
source: Bell delay
hu: Csengő eltolódása

# s_ag_rounding
source: Default rounding
hu: Alapértelmezett kerekítés

# s_customization
source: Customization
hu: Személyre szabás

# s_n
source: Notifications
hu: Értesítések

# s_n_morning
source: Morning notification
hu: Reggeli értesítés

# s_n_morning_time
source: Notification time before school
hu: Értesítés ideje iskola előtt

# s_n_test
source: Send test notification
hu: Teszt értesítés küldése

# s_ag_class_avg_on_graph
source: Class's average on the graph
hu: Osztályátlag a grafikonon

# s_ag_navbar
source: Navbar
hu: Navigációs sáv

# s_ag_left_handed_mode
source: Left-handed mode
hu: Balkezes mód

# s_ag_language_header
source: Language
hu: Nyelv

# s_ag_language_auto
source: Automatic
hu: Automatikus

# s_ag_language_hu
source: Hungarian
hu: Magyar

# s_ag_language_en
source: English
hu: Angol

# s_ag_language_de
source: German
hu: Német

# s_wear_os_support
source: Wear OS support
hu: Wear OS támogatás

# s_c
source: Customization
hu: Személyre szabás

# s_c_icon_header
source: App icons
hu: App ikonok

# s_c_replace_icon
source: Replace icon
hu: Ikon cseréje

# s_ci_icon_header
source: App icon
hu: App ikon

# s_ci_warning_header
source: [!] Changing the app's icon in debug mode won't work
hu: [!] Debug módban nem fog működni az ikon megváltoztatása

# s_ci_icon_subtitle
source: Choose a pretty app icon if you're already tired of the green one.
hu: Válassz egy csodaszép app ikont, ha már unod a zöldet.

# s_ci_icon_g2
source: Felt pen
hu: Filctoll

# s_ci_icon_g3
source: Nostalgia
hu: Nosztalgia

# s_ci_icon_g4
source: Reimagined
hu: Újragondolt

# s_ci_icon_g5
source: Reference
hu: Referencia

# s_ci_icon_g6
source: Christmas logo competition 2024
hu: Karácsonyi logó verseny 2024

# s_ci_icon_g6_desc
source: By @emilia6_6
hu: @emilia6_6 által

# s_c_theme_header
source: Theme
hu: Téma

# s_c_theme_auto
source: Auto
hu: Automatikus

# s_c_theme_light
source: Light
hu: Világos

# s_c_theme_dark
source: Dark
hu: Sötét

# s_ci_child_protection
source: Child protection
hu: Gyermekvédelem

# ic_ace
source: Asexual
hu: Aszexuális

# ic_ace_f
source: Asexual
hu: Aszexuális

# ic_bi
source: Bisexual
hu: Biszexuális

# ic_bi_f
source: Bisexual
hu: Biszexuális

# ic_cactus
source: Cactus grove
hu: Kaktuszliget

# ic_cc
source: Creative Cloud
hu: Kreatív Felhő

# ic_enby
source: Non-binary
hu: Nembináris

# ic_enby_f
source: Non-binary
hu: Nembináris

# ic_fidesz
source: Fidesz
hu: Narancs

# ic_filc
source: Firka
hu: Filc Napló

# ic_galaxy
source: Galaxy
hu: Galaxis

# ic_gay
source: Gay
hu: Meleg

# ic_gay_f
source: Gay
hu: Meleg

# ic_lesb
source: Lesbian
hu: Leszbikus

# ic_lesb_f
source: Lesbian
hu: Leszbikus

# ic_lgbtq
source: LGBTQ+
hu: LMGBTQ+

# ic_lgbtq_f
source: LGBTQ+
hu: LMGBTQ+

# ic_lgbtqp
source: Progression
hu: Progresszió

# ic_lgbtqp_f
source: Progression
hu: Progresszió

# ic_lidl
source: Shopping
hu: Bevásárlás

# ic_mkkp
source: MKKP
hu: Ingyen jegyek

# ic_nuke
source: Nuclear
hu: Nukleáris

# ic_o1g
source: Orbán is a cunt
hu: O1G

# ic_old
source: Domain Dave
hu: Domain Dév Dévid

# ic_original
source: Original
hu: Az eredeti

# ic_paper
source: Paper
hu: Papír

# ic_pear
source: Pear
hu: Körte

# ic_pixelized
source: Pixelified
hu: Pixelizált

# ic_pride
source: Space rainbow
hu: Űrszívárvány

# ic_proto
source: Prototype
hu: Prototípus

# ic_repont
source: Repont
hu: Ötven forint

# ic_szivacs
source: sponge
hu: Szivacs

# ic_trans
source: Trans
hu: Transz

# ic_trans_f
source: Trans
hu: Transz

# ic_void_icon
source: Nothing
hu: Semmi

# ic_xmas1
source: naughty list
hu: Rosszak listája

# ic_xmas2
source: gift
hu: Ajándék

# ic_xmas3
source: FirCristmas
hu: reKarácsony

# s_your_account
source: Your account
hu: Fiókod

# s_acc_kreta
source: e-Kréta accounts
hu: eKRÉTA Fiókok

# s_acc_add
source: Add account
hu: Új fiók hozzáadása

# s_acc_logout
source: Log out
hu: Kijelentkezés

source: Close
hu: Bezárás

# licensesLabel
source: Licenses
hu: Licencek

# licenseDescription
source: Licenses of external libraries used by the app
hu: Az alkalmazás által használt külső könyvtárak licencei

# wear_phone_unpaired
source: Your watch isn't paired with your phone!
hu: Az órád nincs párosítva a telefonoddal!

# wear_phone_disconnected
source: Your watch isn't connected to your phone!
hu: Az órád nincs csatlakoztatva a telefonoddal!

# wear_pairing_request_sent
source: Open the app on your phone
hu: Párosítás folyamatban, nyisd meg az appot a telefonodon

# wear_pairing_check_phone
source: Check your phone
hu: Folytasd a párosítást a telefonodon

# wear_try_again
source: Try again
hu: Újra

# breakTxt
source: Break
hu: Szünet
zu: Restin

source: Empty class
hu: Lyukasóra

# timeLeft
source: {mins, plural, =1{1 min left} other{{mins} mins left}}
hu: Még {mins} perc
zu: Still gotz {mins} minitz

# noClasses
source: School's out today, take it easy!
hu: Nincs ma iskola, pihend ki magad!
zu: No skool todai! Iz nap tiem nao!

# noMoreClasses
source: No more classes for you today
hu: Nincs több órád ma
zu: Ur klassiz R dun todai

# firstIn
source: First class in: {t}
hu: Első órád: {t}
zu: Furzt ur clas: {t}

# wearTitle
source: {n}. class
hu: {n}. óra
zu: Lessun {n}

# la_privacy_header
source: Live Activity Privacy Policy
hu: Live Activity adatvédelmi tájékoztató

# la_privacy_intro
source: To use the Live Activity feature, we need to store and process certain data. Please read the following information carefully.
hu: A Live Activity funkció használatához bizonyos adatokat kell tárolnunk és feldolgoznunk. Kérjük, olvasd el figyelmesen az alábbi tájékoztatót.

# la_privacy_section1_title
source: What data do we store?
hu: Milyen adatokat tárolunk?

# la_privacy_section1_body
source: To enable Live Activity, we store the following data along with your device identifier: • Device identifier (UUID) • Device token • Live Activity push token • APNs push token • Device hash • Language preference • Bell delay offset Your timetable data (lessons table) includes: • Lesson subject and time • Teacher's name • Room name • Lesson number • Lesson theme • Substitution info • Cancelled lesson status Scheduled notifications data (scheduled_notifications table) includes: • Identifier • Device identifier • Scheduled time • Sent status and time • Creation and update times
hu: A Live Activity működéséhez az alábbi adatokat tároljuk eszközazonosítóddal együtt: • Eszköz azonosító (UUID) • Eszköz token • Live Activity push token • APNs push token • Eszköz hash • Nyelvi beállítás • Csengő eltolódása Az órarendi adataid (lessons tábla) a következőket tartalmazzák: • Óra tárgya és időpontja • Tanár neve • Terem neve • Óra sorszáma • Óra témája • Helyettesítés adatai • Elmaradt óra jelzése Az időzített értesítések (scheduled_notifications tábla) a következőket tartalmazzák: • Azonosító • Eszköz azonosító • Időzített időpont • Küldés állapota és ideje • Létrehozás és frissítés ideje

# la_privacy_section2_title
source: How do we protect your data?
hu: Hogyan védjük az adataidat?

# la_privacy_section2_body
source: We take your data security seriously: • All data in the devices and lessons tables is encrypted • Data is stored on secure servers • We only store data for the necessary duration
hu: Komolyan vesszük az adataid biztonságát: • A devices és lessons táblákban lévő összes adat titkosítva van • Az adatokat biztonságos szerveren tároljuk • Csak a szükséges időtartamig tároljuk az adatokat

# la_privacy_section3_title
source: How long do we store the data?
hu: Meddig tároljuk az adatokat?

# la_privacy_section3_body
source: Data storage is limited to the minimum necessary duration: • Live Activity push token: Stored as long as you have lessons on the given day (including the 2-hour period before your first lesson). When you have no more lessons, the value becomes null. • Timetable data: Stored only for the duration of lessons, then automatically deleted. On Friday after your last lesson, the timetable table will be completely empty. • Device data (token, identifiers): Stored as long as the Live Activity feature is enabled. When the feature is turned off, this data is immediately deleted.
hu: Az adatok tárolása minimális időtartamra korlátozódik: • Live Activity push token: Addig van tárolva, amíg óráid vannak az adott napon (beleértve az első óra előtti 2 órás időszakot is). Ha nincs több órád, az érték null lesz. • Órarendi adatok: Csak az órák időtartamára tárolódnak, majd automatikusan törlődnek. Pénteken az utolsó óra után az órarendet tartalmazó tábla teljesen üres lesz. • Eszközadatok (token, azonosítók): Addig van tárolva, amíg a Live Activity funkció engedélyezve van. A funkció kikapcsolásakor ezek az adatok azonnal törlésre kerülnek.

# la_privacy_section4_title
source: How do we use the data?
hu: Mire használjuk az adatokat?

# la_privacy_section4_body
source: We use the data exclusively for operating the Live Activity feature: • Displaying live timetable on the lock screen • Sending push notifications when lessons change • Syncing your timetable on your device • Ensuring Monday morning notifications are delivered even after the weekly database clearance We do not share your data with third parties and do not use it for marketing purposes.
hu: Az adatokat kizárólag a Live Activity funkció működtetésére használjuk: • Élő órarend megjelenítése a lezárási képernyőn • Push értesítések küldése óraváltásokkor • Az órarend szinkronizálása az eszközödön • A hétfő reggeli értesítések kézbesítésének biztosítása a heti adatbázis-ürítés után is Az adataidat nem adjuk át harmadik félnek, és nem használjuk marketing célokra.

# la_privacy_section5_title
source: Your Rights
hu: Jogaid

# la_privacy_section5_body
source: Under GDPR, you have the following rights: • Right to access: You can review the types of data stored in this privacy policy. • Right to erasure: By disabling the Live Activity feature, all data related to the feature (device identifiers, timetable) is immediately and permanently deleted from our servers. • Right to rectification: Timetable data is modified in the Kréta system by authorized persons (e.g., teachers). • Right to object: You can object to data processing at any time by disabling the Live Activity feature.
hu: A GDPR alapján az alábbi jogokkal rendelkezel: • Hozzáférési jog: A tárolt adatok típusát ebben az adatvédelmi tájékoztatóban tekintheted meg. • Törlési jog: A Live Activity funkció kikapcsolásával minden, a funkcióhoz kapcsolódó adat (eszközazonosítók, órarend) azonnal és véglegesen törlődik a szervereinkről. • Módosítási jog: Az órarendi adatok módosítása a Kréta rendszerben történik, az arra jogosult személyek (pl. tanárok) által. • Tiltakozási jog: Az adatkezelés ellen bármikor tiltakozhatsz a Live Activity funkció kikapcsolásával.

# la_privacy_footer
source: Privacy policy last updated: November 2025
hu: Az adatvédelmi tájékoztató utolsó frissítése: 2025. november

# la_privacy_contact
source: Have questions? Contact us at support @firka.app.
hu: Kérdésed van? Keress minket a support @firka.app címen.

# la_privacy_summary1
source: Device tokens, Live Activity tokens, timetable data
hu: Eszköz tokenek, Live Activity tokenek, órarendi adatok

# la_privacy_summary2
source: Encrypted storage, secure servers
hu: Titkosított tárolás, biztonságos szerverek

# la_privacy_summary3
source: Data deleted automatically when not needed
hu: Az adatok automatikusan törlődnek, ha már nincs rájuk szükség

# la_subtitle
source: Display your timetable live on your device's lock screen
hu: Az órarended élő megjelenítése az eszköz lezárási képernyőjén

# la_privacy_title
source: Privacy Policy
hu: Adatvédelmi tájékoztató

# la_privacy_required
source: To use Live Activity, you must accept the privacy policy
hu: A Live Activity használatához el kell fogadnod az adatvédelmi tájékoztatót

# la_learn_more
source: Learn more
hu: Bővebben

# la_accept
source: Accept
hu: Elfogadom

# la_decline
source: Decline
hu: Elutasítom
